[{
    "banner": "./img/banner-capstone.png",
    "title": "CAPSTONE",
    "desc": "Capstone on rapidly prototyping a gamified health care app using Figma. The high-fidelity prototype will gather critical feedback from key stakeholders before development. The design focused on improving patient engagement with treatment plans and communication. Due to confidentiality, the client cannot be named.",
    "link": "",
    "badge": ""
},
{
    "banner": "./img/banner-algo.gif",
    "title": "COMMUNITY LIBRARY",
    "desc": "A .NET console app that organises movies for community libraries. The app uses various algorithms that have undergone theoretical and empirical analyses.",
    "link": "https://github.com/johnnymadigan/community-library-phase-3",
    "badge": "./img/badges/csharp-vs.png"
},
{
    "banner": "./img/banner-carpark.gif",
    "title": "CAR PARK SIMULATOR",
    "desc": "A safety-critical system. Demonstrating my skills in multi-threading, inter-process communication, designing solutions to complex data flows, and handling race conditions and deadlocks. The project consists of 3 separate programs working together to simulate, automate, and protect a car park.",
    "link": "https://github.com/johnnymadigan/carpark-simulator",
    "badge": "./img/badges/c-linux.png"
},
{
    "banner": "./img/banner-networks.gif",
    "title": "NETWORK SEC ANALYSIS",
    "desc": "A network analysis project, requiring us to analyse a server's capture file (Wireshark), identify the attack (SYN flood DoS) and provide mitigation strategies (SYN Cookies and increasing the server backlog). This project allowed my teammate and I to demonstrate our understanding of the OSI Model and protocol vulnerabilities.",
    "link": "",
    "badge": "./img/badges/wireshark.png"
},
{
    "banner": "./img/banner-v1.gif",
    "title": "PORTFOLIO V2",
    "desc": "A culmination of my university projects. What you are seeing is version 2, built with React.js and Material UI. To view version 1 which utilises THREE.js, click the link in the footer (best viewed on desktops as the GLTF model will follow your mouse).",
    "link": "https://github.com/johnnymadigan/johnnymadigan.github.io",
    "badge": "./img/badges/react.png"
},
{
    "banner": "./img/banner-stonk.gif",
    "title": "STOCK MACHINE",
    "desc": "A client-server system for electronic trading of virtual assets. Our team achieved this using an Agile approach with an emphasis on Test-Driven-Development. I primarily focused on user accounts, implementing both front-end and back-end features (Java Swing GUI and SQLite database). For a solo extension on the project, I added a dynamic graph, README to document the app, and a build script for continuous integration and deployment.",
    "link": "https://github.com/johnnymadigan/stonk-machine",
    "badge": "./img/badges/java-intellij-sqlite.png"
},
{
    "banner": "./img/banner-cube.gif",
    "title": "GRAPH THEORY PROJECT",
    "desc": "A Graph Theory project, demonstrating my skills in using math/logic to solve real-world problems. The chosen problem is that Rubik's cubes are often solved in the shortest amount of time, not the least amount of moves. This Python script first generates a Cayley Graph, then uses distance classes and a Breadth-First Search algorithm to find the shortest path between any scrambled cube and the solved state.",
    "link": "https://github.com/johnnymadigan/cube-solver",
    "badge": "./img/badges/py.png"
},
{
    "banner": "./img/banner-arduino.gif",
    "title": "ARDUINO MUSICBOX",
    "desc": "Undertale Musicbox is an Arduino device I created to help those relax. We were given the task to 'invent, design, implement, document, and demonstrate a prototype of a microcontroller-based product'.",
    "link": "https://github.com/johnnymadigan/undertale-musicbox",
    "badge": "./img/badges/c-arduino.png"
},
{
    "banner": "./img/banner-gol.gif",
    "title": "GAME OF LIFE",
    "desc": "Game of Life is a famous zero-player, cellular automaton game. The entire game is a console app where users can configure custom settings to change how the app simulates 'life'. The project demonstrates my understanding of the Object-Oriented-Programming paradigm.",
    "link": "https://github.com/johnnymadigan/game-of-life",
    "badge": "./img/badges/csharp-vs.png"
},
{
    "banner": "./img/banner-v1.gif",
    "title": "PORTFOLIO V1",
    "desc": "A culmination of my university projects. What you are seeing is version 2, built with React.js and Material UI. To view version 1 which utilises THREE.js, click the link in the footer (best viewed on desktops as the GLTF model will follow your mouse).",
    "link": "https://github.com/johnnymadigan/johnnymadigan.github.io",
    "badge": "./img/badges/react.png"
},
{
    "banner": "./img/banner-doggy.jpg",
    "title": "DOGGY DETECTOR",
    "desc": "Doggy Detector is a security camera system I built to keep an eye on my boy George while I was away at work. The project utilises a Raspberry Pi and a USB camera as its hardware, with motionEyeOS as the software. When motion is detected, the system takes snapshots and alerts me via email/uploading images to Dropbox.",
    "link": "",
    "badge": "./img/badges/raspberry.png"
},
{
    "banner": "./img/banner-news.gif",
    "title": "NEWS AGGREGATOR",
    "desc": "The Gotham Times news aggregator allows users to create and export custom news feeds by mixing different sources into a single stream. The project pulls data from 2 local static feeds and 2 live feeds via web scraping.",
    "link": "https://github.com/johnnymadigan/news-aggregator",
    "badge": "./img/badges/py.png"
},
{
    "banner": "./img/banner-disney.gif",
    "title": "DISNEY TILES GENERATOR",
    "desc": "Given an API for generating random patterns, the app can read these instructions and populate the grid with specific tiles. Tiles are unique complex visuals designed using Turtle Graphics.",
    "link": "https://github.com/johnnymadigan/disney-project",
    "badge": "./img/badges/py.png"
}]